app/serializers/user_serializer.rb

  def followed_before
    followed_before =  RelationFollow.find_by(follower_id: @instance_options[:current_user], followed_id: self.object.id)
    if followed_before.present?
---
SELECT "relation_follows".* FROM "relation_follows" WHERE "relation_follows"."follower_id" = $1 AND "relation_follows"."followed_id" = $2 LIMIT $3  [["follower_id", 25], ["followed_id", 25], ["LIMIT", 1]]
SELECT "relation_follows".* FROM "relation_follows" WHERE "relation_follows"."followed_id" = $1  [["followed_id", 13]]