app/controllers/chat_controller.rb

  def create
    if Current.user.authenticated == true
      sender = Current.user.id
      receiver = params[:receiver_id]
      msg = params[:message]
      if sender.present? && receiver.present? && msg.present? && sender != receiver
        valid = Chat.create!(sender_id: sender, receiver_id: receiver, message: msg).valid?
---
INSERT INTO "chats" ("message", "sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "hola mundo"], ["sender_id", 25], ["receiver_id", 25], ["created_at", "2020-11-26 04:28:24.992586"], ["updated_at", "2020-11-26 04:28:24.992586"]]