app/controllers/comment_controller.rb

  def create
    if Current.user.authenticated == true
      tweet = params[:tweet_id]
      cmmnt = params[:comment]
      user_idd = Current.user.id
      if tweet.present? && cmmnt.present? && user_idd.present?
        valid = Comment.create!(tweet_id: tweet, user_id: user_idd, content: cmmnt).valid?
---
INSERT INTO "comments" ("content", "tweet_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hola 25"], ["tweet_id", 9], ["user_id", 25], ["created_at", "2020-11-26 07:01:31.966368"], ["updated_at", "2020-11-26 07:01:31.966368"]]

  def list
    if Current.user.authenticated == true
      tweet = params[:tweet_id]
      if tweet.present?
        @the_tweet = Tweet.find(tweet)
        if @the_tweet.present?
            @comments = @the_tweet.comments.all
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = $1  [["tweet_id", 9]]