app/controllers/like_controller.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
INSERT INTO "likes" ("tweet_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tweet_id", 9], ["user_id", 25], ["created_at", "2020-11-25 04:28:37.407810"], ["updated_at", "2020-11-25 04:28:37.407810"]]
---
  def create

    tweet_id = params[:tweet_id]
    @tuit = Tweet.find(tweet_id)
    if Current.user.authenticated == true && @tuit.present?
      valid = Like.create(user_id: Current.user.id, tweet_id: @tuit.id).valid?

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."tweet_id" = $2 LIMIT $3  [["user_id", 25], ["tweet_id", 9], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy

    tweet_id = params[:tweet_id]
    @tuit = Tweet.find(tweet_id)
    if Current.user.authenticated == true && @tuit.present?
      like = Like.find_by(user_id: Current.user.id, tweet_id: @tuit.id)
      if like.present?
        like.destroy!

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def count
      twt_id = params[:tweetid]
      @tuit = Tweet.find(twt_id)
      if @tuit.present?

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def list
      twt_id = params[:tweetid]
      @tuit = Tweet.find(twt_id)
      if @tuit.present?