app/controllers/tweet_controller.rb

  def create
    if Current.user.authenticated == true
      @tweet = Current.user.tweets.create!(create_params)
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hola mundo"], ["user_id", 25], ["created_at", "2020-11-25 04:01:33.036705"], ["updated_at", "2020-11-25 04:01:33.036705"]]