app/controllers/user_controller.rb

  def create
    @user = User.create!(create_user_params)
---
INSERT INTO "users" ("username", "email", "name", "auth_token", "password_digest", "emailcode", "authenticated", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def confirmation
    @user = User.find_by(username: params[:user])
    if (@user.present? && (@user.emailcode == params[:emailcode]) && @user.authenticated == false)
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jrossetes@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ramos23"], ["LIMIT", 1]]

  def login
    @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ramos"], ["LIMIT", 1]]

  def destroy
    @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ramos"], ["LIMIT", 1]]

  def follows
    if Current.user.authenticated == true
      @user = User.find_by(username: params[:username])
      if @user.present?
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ramos"], ["LIMIT", 1]]

  def profile
    if Current.user.authenticated == true
      @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jaime"], ["LIMIT", 1]]