app/controllers/concerns/secured.rb

  def authenticate_user!
    token_regex = /Bearer (\w+)/
    headers = request.headers

    if headers['Authorization'].present? && headers['Authorization'].match(token_regex)
      token = headers['Authorization'].match(token_regex)[1]
      if(Current.user = User.find_by_auth_token(token))
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "803bf300c3665e09785948ba3131ab57"], ["LIMIT", 1]]